# GetSpecTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..GetSpecTypeId Method
Field Class See Also
---
Gets the spec describing the values stored in this field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ForgeTypeId GetSpecTypeId()
```

Visual Basic
---
```text
Public Function GetSpecTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetSpecTypeId()
```

# ### Return Value
Identifier of the spec.
# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace